ciaa/firmware_v1/externals/drivers/msp430/msp430f5x_6x/lcd_b.h
//*****************************************************************************
//
// The following are values that can be passed to the memory parameter for
// functions: LCD_B_setMemory(), LCD_B_updateMemory(), LCD_B_toggleMemory(),
// LCD_B_clearMemory(), LCD_B_setBlinkingMemory(),
// LCD_B_updateBlinkingMemory(), LCD_B_toggleBlinkingMemory(), and
// LCD_B_clearBlinkingMemory().
//
//*****************************************************************************
#define LCD_B_MEMORY_BLINKINGMEMORY_0                                       (0)
#define LCD_B_MEMORY_BLINKINGMEMORY_1                                       (1)
#define LCD_B_MEMORY_BLINKINGMEMORY_2                                       (2)
#define LCD_B_MEMORY_BLINKINGMEMORY_3                                       (3)
#define LCD_B_MEMORY_BLINKINGMEMORY_4                                       (4)
#define LCD_B_MEMORY_BLINKINGMEMORY_5                                       (5)
#define LCD_B_MEMORY_BLINKINGMEMORY_6                                       (6)
#define LCD_B_MEMORY_BLINKINGMEMORY_7                                       (7)
#define LCD_B_MEMORY_BLINKINGMEMORY_8                                       (8)
#define LCD_B_MEMORY_BLINKINGMEMORY_9                                       (9)
#define LCD_B_MEMORY_BLINKINGMEMORY_10                                     (10)
#define LCD_B_MEMORY_BLINKINGMEMORY_11                                     (11)
#define LCD_B_MEMORY_BLINKINGMEMORY_12                                     (12)
#define LCD_B_MEMORY_BLINKINGMEMORY_13                                     (13)
#define LCD_B_MEMORY_BLINKINGMEMORY_14                                     (14)
#define LCD_B_MEMORY_BLINKINGMEMORY_15                                     (15)
#define LCD_B_MEMORY_BLINKINGMEMORY_16                                     (16)
#define LCD_B_MEMORY_BLINKINGMEMORY_17                                     (17)
#define LCD_B_MEMORY_BLINKINGMEMORY_18                                     (18)
#define LCD_B_MEMORY_BLINKINGMEMORY_19                                     (19)
#define LCD_B_MEMORY_BLINKINGMEMORY_20                                     (20)
#define LCD_B_MEMORY_BLINKINGMEMORY_21                                     (21)
#define LCD_B_MEMORY_BLINKINGMEMORY_22                                     (22)
#define LCD_B_MEMORY_BLINKINGMEMORY_23                                     (23)
#define LCD_B_MEMORY_BLINKINGMEMORY_24                                     (24)
#define LCD_B_MEMORY_BLINKINGMEMORY_25                                     (25)
#define LCD_B_MEMORY_BLINKINGMEMORY_26                                     (26)
#define LCD_B_MEMORY_BLINKINGMEMORY_27                                     (27)
#define LCD_B_MEMORY_BLINKINGMEMORY_28                                     (28)
#define LCD_B_MEMORY_BLINKINGMEMORY_29                                     (29)
#define LCD_B_MEMORY_BLINKINGMEMORY_30                                     (30)
#define LCD_B_MEMORY_BLINKINGMEMORY_31                                     (31)
#define LCD_B_MEMORY_BLINKINGMEMORY_32                                     (32)
#define LCD_B_MEMORY_BLINKINGMEMORY_33                                     (33)
#define LCD_B_MEMORY_BLINKINGMEMORY_34                                     (34)
#define LCD_B_MEMORY_BLINKINGMEMORY_35                                     (35)
#define LCD_B_MEMORY_BLINKINGMEMORY_36                                     (36)
#define LCD_B_MEMORY_BLINKINGMEMORY_37                                     (37)
#define LCD_B_MEMORY_BLINKINGMEMORY_38                                     (38)
#define LCD_B_MEMORY_BLINKINGMEMORY_39                                     (39)

//*****************************************************************************
//
// The following are values that can be passed to the autoDisabled parameter
// for functions: LCD_B_configureChargePump().
//
//*****************************************************************************
#define LCD_B_CHARGEPUMP_NOTAUTO_DISABLED_DURING_ADC_CONVERSION           (0x0)
#define LCD_B_CHARGEPUMP_AUTO_DISABLED_DURING_ADC_CONVERSION        (LCDCPDIS2)

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************

//*****************************************************************************
//
//! \brief Initializes the LCD Module.
//!
//! his function initializes the LCD but without turning on. It bascially setup
//! the clock source, clock divider, clock prescalar, mux rate, low-power
//! waveform and segments on/off. After calling this function, user can config
//! charge pump, internal reference voltage and voltage sources.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param initParams is the pointer to LCD_InitParam structure. See the
//!        following parameters for each field.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_init(uint16_t baseAddress,
                       LCD_B_initParam *initParams);

//*****************************************************************************
//
//! \brief Turns on the LCD module.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDON of \b LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_on(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Turns off the LCD module.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDON of \b LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_off(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears the LCD interrupt flags.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param mask is the masked interrupt flag to be cleared.
//!        Valid values are:
//!        - \b LCD_B_NO_CAPACITANCE_CONNECTED_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_B_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDCAPIFG, \b LCDBLKONIFG, \b LCDBLKOFFIFG
//!        and \b LCDFRMIFG of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_clearInterrupt(uint16_t baseAddress,
                                 uint16_t mask);

//*****************************************************************************
//
//! \brief Gets the LCD interrupt status.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param mask is the masked interrupt flags.
//!        Valid values are:
//!        - \b LCD_B_NO_CAPACITANCE_CONNECTED_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_B_FRAME_INTERRUPT
//!
//! \return None
//!         Return Logical OR of any of the following:
//!         - \b LCD_B_NO_CAPACITANCE_CONNECTED_INTERRUPT
//!         - \b LCD_B_BLINKING_SEGMENTS_ON_INTERRUPT
//!         - \b LCD_B_BLINKING_SEGMENTS_OFF_INTERRUPT
//!         - \b LCD_B_FRAME_INTERRUPT
//!         \n indicating the status of the masked interrupts
//
//*****************************************************************************
extern uint16_t LCD_B_getInterruptStatus(uint16_t baseAddress,
                                         uint16_t mask);

//*****************************************************************************
//
//! \brief Enables LCD interrupt sources.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param mask is the interrupts to be enabled.
//!        Valid values are:
//!        - \b LCD_B_NO_CAPACITANCE_CONNECTED_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_B_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDCAPIE, \b LCDBLKONIE, \b LCDBLKOFFIE and
//!        \b LCDFRMIE of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_enableInterrupt(uint16_t baseAddress,
                                  uint16_t mask);

//*****************************************************************************
//
//! \brief Disables LCD interrupt sources.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param mask is the interrupts to be disabled.
//!        Valid values are:
//!        - \b LCD_B_NO_CAPACITANCE_CONNECTED_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_ON_INTERRUPT
//!        - \b LCD_B_BLINKING_SEGMENTS_OFF_INTERRUPT
//!        - \b LCD_B_FRAME_INTERRUPT
//!        \n Modified bits are \b LCDCAPIE, \b LCDBLKONIE, \b LCDBLKOFFIE and
//!        \b LCDFRMIE of \b LCDCTL1 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_disableInterrupt(uint16_t baseAddress,
                                   uint16_t mask);

//*****************************************************************************
//
//! \brief Clears all LCD memory registers.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDCLRM of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_clearAllMemory(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears all LCD blinking memory registers.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDCLRBM of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_clearAllBlinkingMemory(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Selects display memory.
//!
//! This function selects display memory either from memory or blinking memory.
//! Please note if the blinking mode is selected as
//! LCD_BLINKMODE_INDIVIDUALSEGMENTS or LCD_BLINKMODE_ALLSEGMENTS or mux rate
//! >=5, display memory can not be changed. If
//! LCD_BLINKMODE_SWITCHDISPLAYCONTENTS is selected, display memory bit
//! reflects current displayed memory.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param displayMemory is the desired displayed memory.
//!        Valid values are:
//!        - \b LCD_B_DISPLAYSOURCE_MEMORY  [Default]
//!        - \b LCD_B_DISPLAYSOURCE_BLINKINGMEMORY
//!        \n Modified bits are \b LCDDISP of \b LCDMEMCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_selectDisplayMemory(uint16_t baseAddress,
                                      uint16_t displayMemory);

//*****************************************************************************
//
//! \brief Sets the blink settings.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param clockDivider is the clock divider for blinking frequency.
//!        Valid values are:
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_1 [Default]
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_2
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_3
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_4
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_5
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_6
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_7
//!        - \b LCD_B_BLINK_FREQ_CLOCK_DIVIDER_8
//!        \n Modified bits are \b LCDBLKDIVx of \b LCDBLKCTL register.
//! \param clockPrescalar is the clock pre-scalar for blinking frequency.
//!        Valid values are:
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_512 [Default]
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_1024
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_2048
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_4096
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_8162
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_16384
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_32768
//!        - \b LCD_B_BLINK_FREQ_CLOCK_PRESCALAR_65536
//!        \n Modified bits are \b LCDBLKPREx of \b LCDBLKCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setBlinkingControl(uint16_t baseAddress,
                                     uint8_t clockDivider,
                                     uint8_t clockPrescalar,
                                     uint8_t mode);

//*****************************************************************************
//
//! \brief Enables the charge pump.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDCPEN of \b LCDVCTL register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_enableChargePump(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disables the charge pump.
//!
//! \param baseAddress is the base address of the LCD_B module.
//!
//! Modified bits are \b LCDCPEN of \b LCDVCTL register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_disableChargePump(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Selects the bias level.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param bias is the select for bias level.
//!        Valid values are:
//!        - \b LCD_B_BIAS_1_3 [Default] - 1/3 bias
//!        - \b LCD_B_BIAS_1_2 - 1/2 bias
//!
//! Modified bits are \b LCD2B of \b LCDVCTL register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_selectBias(uint16_t baseAddress,
                             uint16_t bias);

//*****************************************************************************
//
//! \brief Selects the charge pump reference.
//!
//! The charge pump reference does not support
//! LCD_B_EXTERNAL_REFERENCE_VOLTAGE,
//! LCD_B_INTERNAL_REFERNCE_VOLTAGE_SWITCHED_TO_EXTERNAL_PIN when
//! LCD_B_V2V3V4_SOURCED_EXTERNALLY or
//! LCD_B_V2V3V4_GENERATED_INTERNALLY_SWITCHED_TO_PINS is selected.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param reference is the select for charge pump reference.
//!        Valid values are:
//!        - \b LCD_B_INTERNAL_REFERENCE_VOLTAGE [Default]
//!        - \b LCD_B_EXTERNAL_REFERENCE_VOLTAGE
//!        - \b LCD_B_INTERNAL_REFERENCE_VOLTAGE_SWITCHED_TO_EXTERNAL_PIN
//!
//! Modified bits are \b VLCDREFx of \b LCDVCTL register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_selectChargePumpReference(uint16_t baseAddress,
                                            uint16_t reference);

//*****************************************************************************
//
//! \brief Sets the voltage source for V2/V3/V4 and V5.
//!
//! The charge pump reference does not support
//! LCD_B_EXTERNAL_REFERENCE_VOLTAGE,
//! LCD_B_INTERNAL_REFERNCE_VOLTAGE_SWITCHED_TO_EXTERNAL_PIN when
//! LCD_B_V2V3V4_SOURCED_EXTERNALLY or
//! LCD_B_V2V3V4_GENERATED_INTERNALLY_SWITCHED_TO_PINS is selected.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param vlcdSource is the V(LCD) source select.
//!        Valid values are:
//!        - \b LCD_B_VLCD_GENERATED_INTERNALLY [Default]
//!        - \b LCD_B_VLCD_SOURCED_EXTERNALLY
//! \param v2v3v4Source is the V2/V3/V4 source select.
//!        Valid values are:
//!        - \b LCD_B_V2V3V4_GENERATED_INTERNALLY_NOT_SWITCHED_TO_PINS
//!           [Default]
//!        - \b LCD_B_V2V3V4_GENERATED_INTERNALLY_SWITCHED_TO_PINS
//!        - \b LCD_B_V2V3V4_SOURCED_EXTERNALLY
//! \param v5Source is the V5 source select.
//!        Valid values are:
//!        - \b LCD_B_V5_VSS [Default]
//!        - \b LCD_B_V5_SOURCED_FROM_R03
//!
//! Modified bits are \b VLCDEXT, \b LCDREXT, \b LCDEXTBIAS and \b R03EXT of \b
//! LCDVCTL register; bits \b LCDON of \b LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setVLCDSource(uint16_t baseAddress,
                                uint16_t vlcdSource,
                                uint16_t v2v3v4Source,
                                uint16_t v5Source);

//*****************************************************************************
//
//! \brief Selects the charge pump reference.
//!
//! Sets LCD charge pump voltage.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param voltage is the charge pump select.
//!        Valid values are:
//!        - \b LCD_B_CHARGEPUMP_DISABLED [Default]
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_60V_OR_2_17VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_66V_OR_2_22VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_72V_OR_2_27VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_78V_OR_2_32VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_84V_OR_2_37VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_90V_OR_2_42VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_2_96V_OR_2_47VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_02V_OR_2_52VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_08V_OR_2_57VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_14V_OR_2_62VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_20V_OR_2_67VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_26V_OR_2_72VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_32V_OR_2_77VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_38V_OR_2_82VREF
//!        - \b LCD_B_CHARGEPUMP_VOLTAGE_3_44V_OR_2_87VREF
//!
//! Modified bits are \b VLCDx of \b LCDVCTL register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setVLCDVoltage(uint16_t baseAddress,
                                 uint16_t voltage);

//*****************************************************************************
//
//! \brief Sets the LCD Pin as LCD functions.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param pin is the select pin set as LCD function.
//!        Valid values are:
//!        - \b LCD_B_SEGMENT_LINE_0
//!        - \b LCD_B_SEGMENT_LINE_1
//!        - \b LCD_B_SEGMENT_LINE_2
//!        - \b LCD_B_SEGMENT_LINE_3
//!        - \b LCD_B_SEGMENT_LINE_4
//!        - \b LCD_B_SEGMENT_LINE_5
//!        - \b LCD_B_SEGMENT_LINE_6
//!        - \b LCD_B_SEGMENT_LINE_7
//!        - \b LCD_B_SEGMENT_LINE_8
//!        - \b LCD_B_SEGMENT_LINE_9
//!        - \b LCD_B_SEGMENT_LINE_10
//!        - \b LCD_B_SEGMENT_LINE_11
//!        - \b LCD_B_SEGMENT_LINE_12
//!        - \b LCD_B_SEGMENT_LINE_13
//!        - \b LCD_B_SEGMENT_LINE_14
//!        - \b LCD_B_SEGMENT_LINE_15
//!        - \b LCD_B_SEGMENT_LINE_16
//!        - \b LCD_B_SEGMENT_LINE_17
//!        - \b LCD_B_SEGMENT_LINE_18
//!        - \b LCD_B_SEGMENT_LINE_19
//!        - \b LCD_B_SEGMENT_LINE_20
//!        - \b LCD_B_SEGMENT_LINE_21
//!        - \b LCD_B_SEGMENT_LINE_22
//!        - \b LCD_B_SEGMENT_LINE_23
//!        - \b LCD_B_SEGMENT_LINE_24
//!        - \b LCD_B_SEGMENT_LINE_25
//!        - \b LCD_B_SEGMENT_LINE_26
//!        - \b LCD_B_SEGMENT_LINE_27
//!        - \b LCD_B_SEGMENT_LINE_28
//!        - \b LCD_B_SEGMENT_LINE_29
//!        - \b LCD_B_SEGMENT_LINE_30
//!        - \b LCD_B_SEGMENT_LINE_31
//!        - \b LCD_B_SEGMENT_LINE_32
//!        - \b LCD_B_SEGMENT_LINE_33
//!        - \b LCD_B_SEGMENT_LINE_34
//!        - \b LCD_B_SEGMENT_LINE_35
//!        - \b LCD_B_SEGMENT_LINE_36
//!        - \b LCD_B_SEGMENT_LINE_37
//!        - \b LCD_B_SEGMENT_LINE_38
//!        - \b LCD_B_SEGMENT_LINE_39
//!        - \b LCD_B_SEGMENT_LINE_40
//!        - \b LCD_B_SEGMENT_LINE_41
//!        - \b LCD_B_SEGMENT_LINE_42
//!        - \b LCD_B_SEGMENT_LINE_43
//!        - \b LCD_B_SEGMENT_LINE_44
//!        - \b LCD_B_SEGMENT_LINE_45
//!        - \b LCD_B_SEGMENT_LINE_46
//!        - \b LCD_B_SEGMENT_LINE_47
//!        - \b LCD_B_SEGMENT_LINE_48
//!        - \b LCD_B_SEGMENT_LINE_49
//!        - \b LCD_B_SEGMENT_LINE_50
//!        - \b LCD_B_SEGMENT_LINE_51
//!        - \b LCD_B_SEGMENT_LINE_52
//!        - \b LCD_B_SEGMENT_LINE_53
//!        - \b LCD_B_SEGMENT_LINE_54
//!        - \b LCD_B_SEGMENT_LINE_55
//!        - \b LCD_B_SEGMENT_LINE_56
//!        - \b LCD_B_SEGMENT_LINE_57
//!        - \b LCD_B_SEGMENT_LINE_58
//!        - \b LCD_B_SEGMENT_LINE_59
//!        - \b LCD_B_SEGMENT_LINE_60
//!        - \b LCD_B_SEGMENT_LINE_61
//!        - \b LCD_B_SEGMENT_LINE_62
//!        - \b LCD_B_SEGMENT_LINE_63
//!
//! Modified bits are \b LCDSx of \b LCDPCTLx register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setPinAsLCDFunction(uint16_t baseAddress,
                                      uint8_t pin);

