ciaa/firmware_v1/externals/drivers/msp430/msp430f5x_6x/lcd_b.h
//*****************************************************************************
//
//! \brief Sets the LCD Pin as Port functions.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param pin is the select pin set as Port function.
//!        Valid values are:
//!        - \b LCD_B_SEGMENT_LINE_0
//!        - \b LCD_B_SEGMENT_LINE_1
//!        - \b LCD_B_SEGMENT_LINE_2
//!        - \b LCD_B_SEGMENT_LINE_3
//!        - \b LCD_B_SEGMENT_LINE_4
//!        - \b LCD_B_SEGMENT_LINE_5
//!        - \b LCD_B_SEGMENT_LINE_6
//!        - \b LCD_B_SEGMENT_LINE_7
//!        - \b LCD_B_SEGMENT_LINE_8
//!        - \b LCD_B_SEGMENT_LINE_9
//!        - \b LCD_B_SEGMENT_LINE_10
//!        - \b LCD_B_SEGMENT_LINE_11
//!        - \b LCD_B_SEGMENT_LINE_12
//!        - \b LCD_B_SEGMENT_LINE_13
//!        - \b LCD_B_SEGMENT_LINE_14
//!        - \b LCD_B_SEGMENT_LINE_15
//!        - \b LCD_B_SEGMENT_LINE_16
//!        - \b LCD_B_SEGMENT_LINE_17
//!        - \b LCD_B_SEGMENT_LINE_18
//!        - \b LCD_B_SEGMENT_LINE_19
//!        - \b LCD_B_SEGMENT_LINE_20
//!        - \b LCD_B_SEGMENT_LINE_21
//!        - \b LCD_B_SEGMENT_LINE_22
//!        - \b LCD_B_SEGMENT_LINE_23
//!        - \b LCD_B_SEGMENT_LINE_24
//!        - \b LCD_B_SEGMENT_LINE_25
//!        - \b LCD_B_SEGMENT_LINE_26
//!        - \b LCD_B_SEGMENT_LINE_27
//!        - \b LCD_B_SEGMENT_LINE_28
//!        - \b LCD_B_SEGMENT_LINE_29
//!        - \b LCD_B_SEGMENT_LINE_30
//!        - \b LCD_B_SEGMENT_LINE_31
//!        - \b LCD_B_SEGMENT_LINE_32
//!        - \b LCD_B_SEGMENT_LINE_33
//!        - \b LCD_B_SEGMENT_LINE_34
//!        - \b LCD_B_SEGMENT_LINE_35
//!        - \b LCD_B_SEGMENT_LINE_36
//!        - \b LCD_B_SEGMENT_LINE_37
//!        - \b LCD_B_SEGMENT_LINE_38
//!        - \b LCD_B_SEGMENT_LINE_39
//!        - \b LCD_B_SEGMENT_LINE_40
//!        - \b LCD_B_SEGMENT_LINE_41
//!        - \b LCD_B_SEGMENT_LINE_42
//!        - \b LCD_B_SEGMENT_LINE_43
//!        - \b LCD_B_SEGMENT_LINE_44
//!        - \b LCD_B_SEGMENT_LINE_45
//!        - \b LCD_B_SEGMENT_LINE_46
//!        - \b LCD_B_SEGMENT_LINE_47
//!        - \b LCD_B_SEGMENT_LINE_48
//!        - \b LCD_B_SEGMENT_LINE_49
//!        - \b LCD_B_SEGMENT_LINE_50
//!        - \b LCD_B_SEGMENT_LINE_51
//!        - \b LCD_B_SEGMENT_LINE_52
//!        - \b LCD_B_SEGMENT_LINE_53
//!        - \b LCD_B_SEGMENT_LINE_54
//!        - \b LCD_B_SEGMENT_LINE_55
//!        - \b LCD_B_SEGMENT_LINE_56
//!        - \b LCD_B_SEGMENT_LINE_57
//!        - \b LCD_B_SEGMENT_LINE_58
//!        - \b LCD_B_SEGMENT_LINE_59
//!        - \b LCD_B_SEGMENT_LINE_60
//!        - \b LCD_B_SEGMENT_LINE_61
//!        - \b LCD_B_SEGMENT_LINE_62
//!        - \b LCD_B_SEGMENT_LINE_63
//!
//! Modified bits are \b LCDSx of \b LCDPCTLx register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setPinAsPortFunction(uint16_t baseAddress,
                                       uint8_t pin);

//*****************************************************************************
//
//! \brief Sets the LCD pins as LCD function pin.
//!
//! This function sets the LCD pins as LCD function pin. Instead of passing the
//! all the possible pins, it just requires the start pin and the end pin.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param startPin is the starting pin to be configed as LCD function pin.
//!        Valid values are:
//!        - \b LCD_B_SEGMENT_LINE_0
//!        - \b LCD_B_SEGMENT_LINE_1
//!        - \b LCD_B_SEGMENT_LINE_2
//!        - \b LCD_B_SEGMENT_LINE_3
//!        - \b LCD_B_SEGMENT_LINE_4
//!        - \b LCD_B_SEGMENT_LINE_5
//!        - \b LCD_B_SEGMENT_LINE_6
//!        - \b LCD_B_SEGMENT_LINE_7
//!        - \b LCD_B_SEGMENT_LINE_8
//!        - \b LCD_B_SEGMENT_LINE_9
//!        - \b LCD_B_SEGMENT_LINE_10
//!        - \b LCD_B_SEGMENT_LINE_11
//!        - \b LCD_B_SEGMENT_LINE_12
//!        - \b LCD_B_SEGMENT_LINE_13
//!        - \b LCD_B_SEGMENT_LINE_14
//!        - \b LCD_B_SEGMENT_LINE_15
//!        - \b LCD_B_SEGMENT_LINE_16
//!        - \b LCD_B_SEGMENT_LINE_17
//!        - \b LCD_B_SEGMENT_LINE_18
//!        - \b LCD_B_SEGMENT_LINE_19
//!        - \b LCD_B_SEGMENT_LINE_20
//!        - \b LCD_B_SEGMENT_LINE_21
//!        - \b LCD_B_SEGMENT_LINE_22
//!        - \b LCD_B_SEGMENT_LINE_23
//!        - \b LCD_B_SEGMENT_LINE_24
//!        - \b LCD_B_SEGMENT_LINE_25
//!        - \b LCD_B_SEGMENT_LINE_26
//!        - \b LCD_B_SEGMENT_LINE_27
//!        - \b LCD_B_SEGMENT_LINE_28
//!        - \b LCD_B_SEGMENT_LINE_29
//!        - \b LCD_B_SEGMENT_LINE_30
//!        - \b LCD_B_SEGMENT_LINE_31
//!        - \b LCD_B_SEGMENT_LINE_32
//!        - \b LCD_B_SEGMENT_LINE_33
//!        - \b LCD_B_SEGMENT_LINE_34
//!        - \b LCD_B_SEGMENT_LINE_35
//!        - \b LCD_B_SEGMENT_LINE_36
//!        - \b LCD_B_SEGMENT_LINE_37
//!        - \b LCD_B_SEGMENT_LINE_38
//!        - \b LCD_B_SEGMENT_LINE_39
//!        - \b LCD_B_SEGMENT_LINE_40
//!        - \b LCD_B_SEGMENT_LINE_41
//!        - \b LCD_B_SEGMENT_LINE_42
//!        - \b LCD_B_SEGMENT_LINE_43
//!        - \b LCD_B_SEGMENT_LINE_44
//!        - \b LCD_B_SEGMENT_LINE_45
//!        - \b LCD_B_SEGMENT_LINE_46
//!        - \b LCD_B_SEGMENT_LINE_47
//!        - \b LCD_B_SEGMENT_LINE_48
//!        - \b LCD_B_SEGMENT_LINE_49
//!        - \b LCD_B_SEGMENT_LINE_50
//!        - \b LCD_B_SEGMENT_LINE_51
//!        - \b LCD_B_SEGMENT_LINE_52
//!        - \b LCD_B_SEGMENT_LINE_53
//!        - \b LCD_B_SEGMENT_LINE_54
//!        - \b LCD_B_SEGMENT_LINE_55
//!        - \b LCD_B_SEGMENT_LINE_56
//!        - \b LCD_B_SEGMENT_LINE_57
//!        - \b LCD_B_SEGMENT_LINE_58
//!        - \b LCD_B_SEGMENT_LINE_59
//!        - \b LCD_B_SEGMENT_LINE_60
//!        - \b LCD_B_SEGMENT_LINE_61
//!        - \b LCD_B_SEGMENT_LINE_62
//!        - \b LCD_B_SEGMENT_LINE_63
//! \param endPin is the ending pin to be configed as LCD function pin.
//!        Valid values are:
//!        - \b LCD_B_SEGMENT_LINE_0
//!        - \b LCD_B_SEGMENT_LINE_1
//!        - \b LCD_B_SEGMENT_LINE_2
//!        - \b LCD_B_SEGMENT_LINE_3
//!        - \b LCD_B_SEGMENT_LINE_4
//!        - \b LCD_B_SEGMENT_LINE_5
//!        - \b LCD_B_SEGMENT_LINE_6
//!        - \b LCD_B_SEGMENT_LINE_7
//!        - \b LCD_B_SEGMENT_LINE_8
//!        - \b LCD_B_SEGMENT_LINE_9
//!        - \b LCD_B_SEGMENT_LINE_10
//!        - \b LCD_B_SEGMENT_LINE_11
//!        - \b LCD_B_SEGMENT_LINE_12
//!        - \b LCD_B_SEGMENT_LINE_13
//!        - \b LCD_B_SEGMENT_LINE_14
//!        - \b LCD_B_SEGMENT_LINE_15
//!        - \b LCD_B_SEGMENT_LINE_16
//!        - \b LCD_B_SEGMENT_LINE_17
//!        - \b LCD_B_SEGMENT_LINE_18
//!        - \b LCD_B_SEGMENT_LINE_19
//!        - \b LCD_B_SEGMENT_LINE_20
//!        - \b LCD_B_SEGMENT_LINE_21
//!        - \b LCD_B_SEGMENT_LINE_22
//!        - \b LCD_B_SEGMENT_LINE_23
//!        - \b LCD_B_SEGMENT_LINE_24
//!        - \b LCD_B_SEGMENT_LINE_25
//!        - \b LCD_B_SEGMENT_LINE_26
//!        - \b LCD_B_SEGMENT_LINE_27
//!        - \b LCD_B_SEGMENT_LINE_28
//!        - \b LCD_B_SEGMENT_LINE_29
//!        - \b LCD_B_SEGMENT_LINE_30
//!        - \b LCD_B_SEGMENT_LINE_31
//!        - \b LCD_B_SEGMENT_LINE_32
//!        - \b LCD_B_SEGMENT_LINE_33
//!        - \b LCD_B_SEGMENT_LINE_34
//!        - \b LCD_B_SEGMENT_LINE_35
//!        - \b LCD_B_SEGMENT_LINE_36
//!        - \b LCD_B_SEGMENT_LINE_37
//!        - \b LCD_B_SEGMENT_LINE_38
//!        - \b LCD_B_SEGMENT_LINE_39
//!        - \b LCD_B_SEGMENT_LINE_40
//!        - \b LCD_B_SEGMENT_LINE_41
//!        - \b LCD_B_SEGMENT_LINE_42
//!        - \b LCD_B_SEGMENT_LINE_43
//!        - \b LCD_B_SEGMENT_LINE_44
//!        - \b LCD_B_SEGMENT_LINE_45
//!        - \b LCD_B_SEGMENT_LINE_46
//!        - \b LCD_B_SEGMENT_LINE_47
//!        - \b LCD_B_SEGMENT_LINE_48
//!        - \b LCD_B_SEGMENT_LINE_49
//!        - \b LCD_B_SEGMENT_LINE_50
//!        - \b LCD_B_SEGMENT_LINE_51
//!        - \b LCD_B_SEGMENT_LINE_52
//!        - \b LCD_B_SEGMENT_LINE_53
//!        - \b LCD_B_SEGMENT_LINE_54
//!        - \b LCD_B_SEGMENT_LINE_55
//!        - \b LCD_B_SEGMENT_LINE_56
//!        - \b LCD_B_SEGMENT_LINE_57
//!        - \b LCD_B_SEGMENT_LINE_58
//!        - \b LCD_B_SEGMENT_LINE_59
//!        - \b LCD_B_SEGMENT_LINE_60
//!        - \b LCD_B_SEGMENT_LINE_61
//!        - \b LCD_B_SEGMENT_LINE_62
//!        - \b LCD_B_SEGMENT_LINE_63
//!
//! Modified bits are \b LCDSx of \b LCDPCTLx register; bits \b LCDON of \b
//! LCDCTL0 register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setPinAsLCDFunctionEx(uint16_t baseAddress,
                                        uint8_t startPin,
                                        uint8_t endPin);

//*****************************************************************************
//
//! \brief Sets the LCD_B memory register.
//!
//! This function sets the entire one LCD_B memory register.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding memory.
//!
//! Modified bits are \b MBITx of \b LCDMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setMemory(uint16_t baseAddress,
                            uint8_t memory,
                            uint8_t mask);

//*****************************************************************************
//
//! \brief Updates the LCD_B memory register.
//!
//! This function updates the specific bits in the LCD_B memory register
//! according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding memory.
//!
//! Modified bits are \b MBITx of \b LCDMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_updateMemory(uint16_t baseAddress,
                               uint8_t memory,
                               uint8_t mask);

//*****************************************************************************
//
//! \brief Toggles the LCD_B memory register.
//!
//! This function toggles the specific bits in the LCD_B memory register
//! according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding memory.
//!
//! Modified bits are \b MBITx of \b LCDMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_toggleMemory(uint16_t baseAddress,
                               uint8_t memory,
                               uint8_t mask);

//*****************************************************************************
//
//! \brief Clears the LCD_B memory register.
//!
//! This function clears the specific bits in the LCD_B memory register
//! according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding memory.
//!
//! Modified bits are \b MBITx of \b LCDMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_clearMemory(uint16_t baseAddress,
                              uint8_t memory,
                              uint8_t mask);

//*****************************************************************************
//
//! \brief Sets the LCD_B blinking memory register.
//!
//! This function sets the entire one LCD_B blinking memory register.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select blinking memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding blinking memory.
//!
//! Modified bits are \b MBITx of \b LCDBMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_setBlinkingMemory(uint16_t baseAddress,
                                    uint8_t memory,
                                    uint8_t mask);

