ciaa/firmware_v1/externals/drivers/msp430/msp430f5x_6x/lcd_b.h
//*****************************************************************************
//
//! \brief Updates the LCD_B blinking memory register.
//!
//! This function updates the specific bits in the LCD_B blinking memory
//! register according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select blinking memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding blinking memory.
//!
//! Modified bits are \b MBITx of \b LCDBMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_updateBlinkingMemory(uint16_t baseAddress,
                                       uint8_t memory,
                                       uint8_t mask);

//*****************************************************************************
//
//! \brief Toggles the LCD_B blinking memory register.
//!
//! This function toggles the specific bits in the LCD_B blinking memory
//! register according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select blinking memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding blinking memory.
//!
//! Modified bits are \b MBITx of \b LCDBMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_toggleBlinkingMemory(uint16_t baseAddress,
                                       uint8_t memory,
                                       uint8_t mask);

//*****************************************************************************
//
//! \brief Clears the LCD_B blinking memory register.
//!
//! This function clears the specific bits in the LCD_B blinking memory
//! register according to the mask.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param memory is the select blinking memory for setting value.
//!        Valid values are:
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_0
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_1
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_2
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_3
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_4
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_5
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_6
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_7
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_8
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_9
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_10
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_11
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_12
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_13
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_14
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_15
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_16
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_17
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_18
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_19
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_20
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_21
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_22
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_23
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_24
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_25
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_26
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_27
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_28
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_29
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_30
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_31
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_32
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_33
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_34
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_35
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_36
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_37
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_38
//!        - \b LCD_B_MEMORY_BLINKINGMEMORY_39
//! \param mask is the designated value for the corresponding blinking memory.
//!
//! Modified bits are \b MBITx of \b LCDBMx register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_clearBlinkingMemory(uint16_t baseAddress,
                                      uint8_t memory,
                                      uint8_t mask);

//*****************************************************************************
//
//! \brief Configs the charge pump for synchronization and disabled capability.
//!
//! This function is device-specific. The charge pump clock can be synchronized
//! to a device-specific clock, and also can be disabled by connected function.
//!
//! \param baseAddress is the base address of the LCD_B module.
//! \param autoDisabled is the synchronization select.
//!        Valid values are:
//!        - \b LCD_B_CHARGEPUMP_NOTAUTO_DISABLED_DURING_ADC_CONVERSION
//!           [Default]
//!        - \b LCD_B_CHARGEPUMP_AUTO_DISABLED_DURING_ADC_CONVERSION
//!
//! Modified bits are \b LCDCPDIS2 of \b LCDBCPCTL register.
//!
//! \return None
//
//*****************************************************************************
extern void LCD_B_configureChargePump(uint16_t baseAddress,
                                      uint16_t autoDisabled);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_LCD_B_H__
